[{"pageContent":"","metadata":{"source":"https://vccf.org/staff/","title":"","contentLength":0}},{"pageContent":"","metadata":{"source":"https://vccf.org/about/","title":"","contentLength":0}},{"pageContent":"Dear Ventura County Community Foundation Family, On March 13th, the Ventura County Community Foundation, in coordination with the County of Ventura, Amgen Foundation, Aera Energy, Southeast Ventura County YMCA, Give An Hour, and the Economic Development Collaborative, launched the Ventura County Rapid Response Fund. The next day, the 805 UndocuFund COVID-19 fund was activated with partner organizations, including Future Leaders of America, CAUSE, MICOP, and the McCune Foundation. Immediately, VCCF awarded the following grants: $25,000 to the Southeast Ventura County YMCA for their work in launching individual and family assistance grants available to residents meeting eligibility criteria in Ventura County. $25,000 to the Economic Development Collaborative to help support their direct business advising program to help local firms navigate through the economic slowdown and connect businesses with the full range of resources available, including low cost capital. $25,000 to Give An Hour to provide mental health and emotional wellness needs in our community by launching daily online support groups in both English and Spanish. Within a few days, VCCF awarded additional grants for our community: $120,000 to the Southeast Ventura County YMCA to help several hundred families with direct financial assistance grants. The first round of payments to families is being distributed on April 10th. $300 to support critical programing for nonprofits on legal issues relating to COVID-19 provided by the Center for Nonprofit Leadership. $125,000 to Women’s Economic Ventures for a 1:1 matching grant to support the Quick Response Loan Fund for micro-businesses in Ventura County. These businesses are defined as those with fewer than five employees and less than $1 million in annual revenues, and generally do not qualify for SBA Disaster Recovery Loans. $50,000 to the 805 UndocuFund COVID-19 Fund to provide support to undocumented immigrants during times of COVID-19. And, yesterday, the VCCF Board approved additional emergency funds for our community: $60,000 to FoodSHARE for unrestricted support to support the logistics of delivering food in current circumstances and support the emergency need to purchase food for tens of thousands in our community. $25,000 to Future Leaders of America to support staffing needs related to the 805 Undocufund. Within the first 24 hours of the application being open more than 1,700 applications were received. By the following morning, 300 additional applications were received. The demand is tremendous as our local service workers and farm workers respond to the impacts associated with COVID-19. $40,000 to Mixteco/Indigena Community Organizing Project (MICOP) for general operating support to assist with a robust outreach and education effort and to ensure the indigenous community have the resources they need during COVID-19. VCCF donors have also activated their personal giving, supporting numerous local organizations, including Safe Passage, delivering daily meals to 200 at-risk youth, the Ventura County Rescue Mission, 805 UndocuFund, Interface Children & Family Service, and 2-1-1. As of yesterday, 100% of funds received have been distributed. We are actively fundraising for additional dollars and will be awarding funding to local nonprofit organizations rapidly as additional contributions are received. The need is unprecedented. We have received millions in requests for support and will do all we can to help. It will take all of us collaborating together, which is why VCCF is not assessing any administrative fees and 100% of funds contributed will help those who need it most. I wish I could share my inbox with you. In the face of so many challenges, I am receiving hundreds of emails from local community members stepping forward to help their neighbors during this time. It is heartwarming and reinforces the fact that Ventura County is a resilient and generous community. We will get through this together! Best, Vanessa","metadata":{"source":"https://vccf.org/a-letter-from-our-president-ceo-vanessa-bechtel/","title":"A Letter from Our President & CEO, Vanessa Bechtel","date":"2020-04-07","contentLength":627}},{"pageContent":"","metadata":{"source":"https://vccf.org/blog-posts/","title":"","contentLength":0}},{"pageContent":"Vanessa Bechtel, VCCF President & CEO, was a guest commentator at the CLU Center for Economic Research & Forecasting’s 2022 Ventura County Economic Forecast on Monday, March 8 at the Thousand Oaks Civic Arts Center Scherr Forum. The event included an in-depth analysis of the county’s economic performance and an assessment of its economic and demographic future. The state and local forecast was led by Matthew Fineup, executive director of CERF, with several guest commentator videos throughout his presentation. Vanessa spoke in her video about the 2020 Ventura County Complete Counts Census initiative and the success of the campaign, reaching the 95th percentile in the nation for an accurate census count when the county was once considered at-risk for undercounting in the 2020 census. In her recorded interview, Vanessa said on the county’s census efforts, “Going from the bottom 2% to the top 95th percentile, I think, reflects the strength of our region. Because it wasn’t money that did that. It was people proactively owning the situation and doing all they could to make a difference. And we did that. It was amazing.” If you would like to view the 2022 webcast recording or read additional publications, click here to see the CLU CERF website.","metadata":{"source":"https://vccf.org/2022-cerf-economic-forecast-guest-commentator-vccfs-vanessa-bechtel/","title":"2022 CERF Economic Forecast — Guest Commentator VCCF’s Vanessa Bechtel","date":"2022-03-09","contentLength":209}},{"pageContent":"Pacific Coast Business Times has nominated VCCF President & CEO Vanessa Bechtel and VCCF Board of Directors Treasurer Veronica Quintana for their 2021 Top 50 Women in Business list. The Business Times honors 50 of the region’s top women leaders in a number of private employer sectors, including finance, professional services, CRE, health care, technology and nonprofits. To read the full list, click here. Congratulations, Vanessa and Veronica!","metadata":{"source":"https://vccf.org/vanessa-bechtel-and-veronica-quintana-named-top-50-women-in-business/","title":"Vanessa Bechtel and Veronica Quintana Named Top 50 Women in Business","date":"2021-11-22","contentLength":68}},{"pageContent":"","metadata":{"source":"https://vccf.org/latest-coverage/","title":"","contentLength":0}},{"pageContent":"Dear Ventura County Community Foundation Family, Over these past few weeks, your generosity has reminded all of us at your community foundation that small acts of compassion and kindness makes a world of difference. My heart goes out to you in gratitude, thank you! As the war in Ukraine continues, so many in our foundation family have reached out, asking for guidance on how to best support those fleeing for safety. Together, we’ve grieved for the victims of horrific violence and have struggled as we continue to witness millions losing homes, communities, and loved ones in a matter of moments. Once again, you have stepped forward, demonstrating through your actions that when we feel most afraid, and during times of our greatest sadness, the small act of giving is one of most profound and powerful tools we have to create the change we seek. There are literally dozens of nonprofit organizations working to help, including our sister community foundations abroad. Ednannia, for example, is supporting the largest community foundation network in Ukraine. The Council on Foundations has also published guidance for making grants to help those most impacted by the humanitarian crisis. Their message to us, “We each matter and we all have the ability to help.” On a personal note, if you, like me, are craving moments of quiet reflection and hope, I highly recommend listening to “The Dreamer” by Immanuel Wilkins. I just love this piece of music – I actually have it on repeat as I write you – and his thoughtful style inspires me to stay focused and to remember what we can accomplish when we all come together. Featured in this newsletter is the Santa Paula Highest Quality Early Childhood Education Initiative, our Transfer of Wealth Initiative that we’ve been so honored to partner with Cal Lutheran’s Center for Nonprofit Leadership on, an interview with two of our treasured community foundation friends – Meenal and Kris Kelkar, a brief introduction to the VCCF Environmental Initiative, and more! Please know we welcome your involvement and invite each of you to reach out anytime if you’d like to get more involved in these, or any, of your community foundation’s endeavors. My very best to you, Vanessa Vanessa Bechtel President & CEO, Ventura County Community Foundation Highest Quality Early Childhood Education for All The Santa Paula Early Childhood Education Steering Committee convened in February to discuss critical action steps for bringing no cost, highest quality early childhood education to all young children in Santa Paula. The Ventura County Community Foundation is proud to support this herculean and vital effort. This historic undertaking seeks to serve close to 1,000 children between the ages of 3 and 4 each year. Please contact Calleen Pardinas for more information. Learn More Our Collective Opportunity: Ventura County’s Historic Transfer of Wealth On March 3, VCCF co-convened the Nonprofit Leadership Council workshop with the CLU Center for Nonprofit Leadership. This session focused on the recently updated Transfer of Wealth study and analysis commissioned by VCCF on the donor landscape in Ventura County, including rich data on wealth trends, donor preferences and how nonprofits can be prepared and positioned for the largest generational transfer of wealth in our nation’s history. As our friends at the California Community Foundation share, “This is not an opportunity to fix things today. It is an opportunity to plan our futures, to plan for the sustainability of our community’s ability to serve people who have the greatest needs.” Learn More Meet Meenal and Kris Kelkar “Everything is needed, so find what you’re passionate about and start there. All of us hold a piece of the puzzle, so it’s not that one piece of the puzzle is any bigger or more valuable than the rest, and it all then needs to come together.” – Meenal Kelkar VCCF’s intern Daniel Whitworth had the opportunity to speak with longtime VCCF donor-clients Meenal and Kris Kelkar. Read more and find out why we love these two amazing humans so much! Click the button below to read their interview. Read More Tree Mitigation Efforts in Ventura County The County of Ventura’s Sustainability Division’s mission is to support sensible growth, healthy environment and economy, enhanced quality of life, inclusion and equity, and greater self-reliance throughout all of Ventura County. Our County’s Climate Action Plan (CAP) related implementation program of the County’s General Plan which assigns the Resource Management Agency, General Services Agency, and County Executive Office to work jointly to conduct tree planting activities with the goal of planting at least one thousand trees annually. This webinar serves as the first step in the County of Ventura’s Sustainability Division’s efforts of establishing thoughtful collaboration with all stakeholders involved in preserving Ventura County’s tree canopy along with sharing and strengthening forestry resources. VCCF’s Calleen Pardinas was invited to present on the findings of the Environmental Listening Tour. For more information, please email cpardinas@vccf.org. View Ventura County Climate Action Plan CERF Economic Forecast This year’s Annual Ventura County Economic Forecast hosted by the California Lutheran University Center for Economic Research and Forecasting (CERF) was back in person on March 8, hosted by CERF Executive Director Matthew Fienup. This premier networking and forecast event included an in-depth analysis of the county’s economic performance and an assessment of its economic and demographic future, as well as detailed analysis and forecasts for the United States and California economies. VCCF President & CEO Vanessa Bechtel was a guest commentator and spoke in her video about the 2020 Ventura County Complete Counts Census initiative and the success of the campaign, reaching the 95th percentile in the nation for an accurate census count. Read More VCCF’s Vanessa Bechtel Receives Chairperson’s Award of Excellence West Ventura County Business Alliance named VCCF’s president and CEO Vanessa Bechtel one of the recipients of the annual Chairperson’s Award of Excellence. Honorees were celebrated at a luncheon on Friday, March 4 for their leadership in Ventura County. Congratulations, Vanessa! Read More Power of Community Good News from YOUR Ventura County Community Rising from the Ashes Home Tour The Ventura County Library Foundation is excited to announce the long-awaited Rising from the Ashes Home Tour is back on. On Saturday, April 30, the strength and resilience of Ventura will be in view during a tour of some of the beautifully rebuilt homes. It will be clear the Thomas Fire of 2017 caused devastation, but not defeat. Tickets are $40, and all proceeds will go to support the work of Ventura County libraries. These donations will enable VCLF to fund important literacy programs, the Mobile Library, broader access to the internet and computers to close the digital divide, homework tutoring, STEAM initiatives, and much more. The homes’ distinctive and unique architecture captures the views from these hills while new landscaping embraces fire mitigation measures. This unique opportunity to tour newly rebuilt homes in the Ondulando, Clearpoint, and Skyline areas of Ventura promises to be a delightful afternoon that will showcase resilience, creativity, and beauty of six spectacular Ventura hillside residences. Click the button below to learn more and purchase tickets. Read More Events Calendar Cesar Chavez Celebration Day Thursday, March 31 from 2 to 3:30 pm (Virtual) Join the County of Ventura Diversity, Equity, & Inclusion Council in celebration of Cesar Chavez Day. Hear from Paul Chavez, son of Cesar Chavez and President of the Cesar Chavez Foundation, as he discusses his father’s legacy, contributions and the impact he had on Ventura County. Spanish and Mixteco interpretation will be available. Click here to register. Virtual Donor Lunch & Learn Thursday, April 28 from 12 to 1 pm (Virtual) Join fellow VCCF donors and community members for a Zoom presentation by Mesa, a nonprofit focused on providing homeless youth with transitional housing, as well as an update on the Tiny Homes Pilot Program. Click here to register. 805 UndocuFund Presents: Serving Undocumented Communities in Disaster and Beyond Wednesday, May 18, 2022 at 10 AM (Virtual) Join us at a panel discussion hosted by 805 UndocuFund to discuss lessons we’ve learned in serving undocumented communities that fellow nonprofits, school/government agencies and philanthropy can apply in working with their undocumented immigrant clients. We’ll also explore how disasters illustrate underlying socio-economic factors and systemic barriers that must be addressed before, during, and after disaster. Click here to register.","metadata":{"source":"https://vccf.org/power-of-purpose-newsletter-march-30-2022/","title":"Power of Purpose Newsletter — March 30, 2022","date":"2022-03-31","contentLength":1414}},{"pageContent":"","metadata":{"source":"https://vccf.org/newsletters/","title":"","contentLength":0}},{"pageContent":"FOR IMMEDIATE RELEASE October 26, 2021 Vanessa Bechtel Ventura County Community Foundation 805-330-6676 vbechtel@vccf.org Ventura County Community Foundation Celebrates the Service of Outgoing Board Chair, Scott Hansen, and Announces Board Leadership Changes Camarillo, CA — After six years as the Chair of the Board of Directors for the Ventura County Community Foundation (VCCF), Scott Hansen, Regional Managing Director for the Valley Market of Wells Fargo Private Wealth Management, is passing the baton to VCCF’s incoming Board Chair, Sean Leonard. During his tenure as Chair, Scott Hansen has overseen close to $100 million in grantmaking to the Ventura County community, including VCCF’s disaster response efforts to help those impacted by the Thomas, Hill, Woolsey wildfires and Borderline mass shooting, as well as its COVID-19 relief efforts. Hansen has also championed the community foundation’s 2020 Census outreach efforts, Caregiving Initiative, Farmworker Household Assistance Program, Vaccine Outreach & Education, scholarships to over 1,000 students, and grants to more than 500 local nonprofit organizations. “As my home for over 20 years, it is truly an honor to give back and serve the Ventura County community. I look forward to continuing on VCCF’s Board of Directors, working closely with Sean, to advance our mission of connecting people, resources, and solutions to create lasting impact in our shared world,” said Hansen. Sean Leonard joined VCCF’s Board of Directors in 2019 and is passionate about increasing access to affordable housing and supporting our local nonprofit sector. Leonard is President and CEO of S.L. Leonard & Associates, Inc., which he founded in 2004, and his firm is a certified Minority Business Enterprise that provides Owner’s Representation, Project, and Construction management for nonprofits, public agencies, developers, businesses, and investors. He serves on the boards of A Community of Friends, Casa Pacifica Centers for Children & Families. Veronica Quintana will remain as VCCF’s Treasurer, and Leah Lacayo will serve as VCCF’s Secretary. Quintana is a Senior Manager at CBIZ and Mayer Hoffman McCann P.C. and specializes in providing services to companies in the agricultural, construction, manufacturing, restaurant, and professional service industries. She cares deeply about our community’s youth and serves on the Board of the Oxnard and Port of Hueneme Boys and Girls Club. Leah Lacayo, a 35-year resident of Ventura County, is highly regarded for her community activism. She serves on the Ventura County Fair Board as Vice-Chair, CSU Channel Islands Alumni & Friends Association as Immediate Past Co-President, Ventura County Women’s Political Council, and Congress of California Seniors Education & Research Fund. ABOUT VENTURA COUNTY COMMUNITY FOUNDATION Established in 1987, the Ventura County Community Foundation has focused on building philanthropy in our region by stewarding legacies through careful management of the charitable capital entrusted to us. We are committed to a long-term perspective for Ventura County. We honor donor intent by protecting endowments forever, and we specialize in connecting philanthropic resources with community needs for the benefit of all. We invest in the future through scholarships, grant making, and collaborative partnerships. For more information, please visit www.vccf.org. ###","metadata":{"source":"https://vccf.org/press-release-ventura-county-community-foundation-celebrates-the-service-of-outgoing-board-chair-scott-hansen-and-announces-board-leadership-changes/","title":"Press Release: Ventura County Community Foundation Celebrates the Service of Outgoing Board Chair, Scott Hansen, and Announces Board Leadership Changes","date":"2021-10-26","contentLength":517}},{"pageContent":"Watch the video below or on the Our Ventura TV website. Vanessa Bechtel speaks with Sandra Siepak about the Ventura County Community Foundation. Established in 1987, the Ventura County Community Foundation nurtures philanthropy in Ventura County through management of charitable capital. They honor donor intent by protecting endowments forever and connecting philanthropic resources with community need, particularly through scholarships, grant making, and collaborative partnerships. Producer: GeorgeAlger.com Director: Petrina Sharp Asst. Director: Bill O’Connor Floor Manager: Michelle Hoover Sponsor: NONPROFIT FIRE, Fundraising for Nonprofits NonProfitFire.org Sponsor: PJ MURALS, We Paint Your World Beautiful PJmurals.com Sponsor: SKYWORKS MARKETING, Performance Advertising SkyworksMarketing.com","metadata":{"source":"https://vccf.org/vccf-on-our-ventura-tv/","title":"VCCF on Our Ventura TV","date":"2018-03-20","contentLength":104}},{"pageContent":"Dear Ventura County Community Foundation Family, On Saturday, August 14 I was very grateful to attend Rubicon Theatre Company’s “Dare to Dream” Summer Education Series’ production of Les Misérables. It was ABSOLUTELY FABULOUS and a shining example of how philanthropy changes lives. I particularly want to thank Loretta and Mike Merewether, the Smith-Hobson Foundation, Jeanne P. Adams and Barbara Meister for helping to support this incredible opportunity for 21 students, ages 8 to 18, to perform together. I urge all to watch this very moving video of the lead young man who played Jean Valjean and his fellow castmates – they truly blew me away with their talent and heart!! As many of you know, my life was also changed by a philanthropist when I was very young. This donor helped provide me with a violin and lessons from 2.5 years old all the way through 5th grade. While I did not end up being a professional musician, I still love to play, and I owe music so much. Not only did this generous donor inspire a lifelong passion, but music ended up being my gateway to college and a source of revenue when I was younger. My gratitude for being given this opportunity also instilled a deep sense of urgency to give back, ultimately shaping the course of my life and career. We may never know the full impact we will have on another’s life or the full reach of our individual contributions on the world, but on Saturday night, what was clearly evident was the total and complete joy of these young people. It was truly beautiful and something to treasure in a time filled with so many challenges. Since I last wrote, the VCCF Board of Directors approved $745,248.38 in additional grants, only made possible because of each of you. From support to Thomas, Hill, and Woolsey fire victims, to support for our libraries, access to food, rental assistance, housing, and animal welfare, I can’t think of an area of our community you aren’t touching together. On behalf of all of us, thank you! Thinking of you, Vanessa Vanessa Bechtel President & CEO of the Ventura County Community Foundation Read More about Dare to Dream Congratulations VCCF 2021 Scholarship Recipients! Our students submitted wonderful stories and photos of how VCCF scholarships are impacting their families, their education, and their future. Please click below to see the moving stories of our 2021 VCCF scholarship recipients. #BecauseYouGave Read More September – Mark and Jacob Iskander Fund Matching Campaign The Mark & Jacob Iskander Foundation has announced a matching fund for September to honor the anniversary of Jacob and Mark’s passing on September 29, 2020. All donations made to the foundation will be matched 100 percent until the end of the month. Donations will go towards efforts such as the recently launched scholarships (read below), as well as the funding of a child development center and orphanage in Egypt. The foundation is hoping to complete the remodeling of the Mark & Jacob Iskander Orphanage by September 29 in their honor. Donate Now Mark and Jacob Iskander Scholarship Accepting Applications Education has always been a cornerstone of the Mark & Jacob Iskander Foundation because Mark and Jacob were always incredibly enthusiastic about learning. The Iskander Foundation has partnered with Ascension Lutheran School and Oaks Christian School in order to give foster children the financial support needed to access an education at these wonderful institutions attended by Mark and Jacob. If you know an outstanding young individual in the foster care system, living in the Conejo Valley/Ventura County area, who might benefit from these programs, share the link below. Applications Open Santa Paula Art Museum’s Online Fine Art Auction Fundraiser The Santa Paula Art Museum’s online Fine Art Auction Fundraiser is happening now on Bidsquare! Now through Sunday, August 29, place your bids on 21 stunning works of art by some of our region’s most popular historic and contemporary artists. All proceeds benefit the Museum and the thousands of students and visitors it serves each year. The Santa Paula Art Museum is a 501(c)3 tax-exempt, nonprofit organization. Click here to register and bid. “East of Town” by Santa Paula artist Gail Pidduck Ventura County Rapid Response Fund Reopened The Ventura County Rapid Response Fund has reopened after an increase in Covid-19 cases countywide. The purpose of the Rapid Response Fund has been to support those organizations providing basic human needs to individuals, families, and small businesses in Ventura County. Click here to learn more. Donate Now Business Assistance Grants Round 8 Nonprofit Cultural Institutions Only The County of Ventura is offering an additional round of Business Assistance Grants for nonprofit cultural institutions. Round 8 will support California eligible nonprofit cultural institutions of any revenue size that meet eligibility criteria found at CAReliefGrant.com. Eligible nonprofit cultural institutions must complete a new application even if they already applied in Rounds 1, 2, 5 or 6; nonprofit cultural institutions that applied in Round 4 do not need to reapply. Grants will only be available to nonprofit cultural institutions that did not receive funding in any previous rounds. Grants will be prioritized based on the documented percentage revenue declines based on a reporting period comparing Q2 and Q3 of 2020 versus Q2 and Q3 of 2019. Important Dates for Round 8: Application Opens: August 27, 2021 Application Closes: September 8, 2021 Congratulations, Dr. Gabino Aguirre! The Pacific Coast Business Times honored Dr. Gabino Aguirre with their Latino Business Award for his tireless contributions to the Ventura County 2020 Census efforts. Dr. Aguirre led as the Region 5 Coordinator for Ventura county, and continues to serve his community through his commitment to vaccination outreach efforts as well as his work with VCCF’s Santa Paula Early Childhood Education steering committee. Welcome Ginny Claborn! Ginny Claborn, Philanthropic Services Officer will focus on connecting with donors to share the powerful and positive impact made through their generosity. In addition, she will be part of the team responsible for the oversight of grants and strategic initiatives. Her passion for serving in the nonprofit community began as a volunteer and led to serving on the national staff of Habitat for Humanity International specializing in organizational development. She continues to volunteer and serves on the Board of Directors for CASA (Court Appointed Special Advocates) of Ventura County. Read More VCCF Donor Spotlight – Christine Dale VCCF’s Ginny Claborn interviewed donor Christine Dale about her life’s journey into philanthropy and the causes closest to her heart. Come see why we love her so much! Read the Interview Power of Community Good News from YOUR Ventura County Community Make-A-Wish — Sergio’s Wish I wish to be a firefighter! In September 2019, Sergio, 6, was playing outside and complained he had bad pain on his left thigh, and his mother rushed him to the ER. Soon after, Sergio was diagnosed with leukemia.Sergio dreams of becoming a firefighter one day. On Wish day, Make-A-Wish and the Oxnard Fire Department transformed Oxnard Fire Station 1 into a spectacular wish celebration for Sergio. Inside the fire house, a locker bearing Sergio’s name held his custom uniform, complete with his name, patches and reflective stripes just like a real firefighter. Oxnard Fire Chief, Alex Hamilton, added an official badge to the uniform in a special ceremony. He wore it with pride while taking a tour of the fire station, riding in the fire truck, and using the firehose in a safely controlled fire simulation. Big thanks to the Oxnard Fire Department Station 1 and everyone who helped make this wish truly special. With the dedication of our community, Make-A-Wish hopes to make many more wishes come true this year. Visit the Make-A-Wish Website","metadata":{"source":"https://vccf.org/power-of-purpose-newsletter-august-26-2021/","title":"Power of Purpose Newsletter – August 26, 2021","date":"2021-09-01","contentLength":1308}},{"pageContent":"Photo by T Christian Gapen As president and CEO of the Ventura County Community Foundation, Vanessa Bechtel is working to bring together donors, nonprofits and people in need to find workable solutions to the issues facing our community. Vanessa Bechtel steers the economic engine of charitable giving. By Nancy D. Lackey Shaffer Vanessa Bechtel loves the violin. She has played since she was a child, and it’s been a constant source of joy and inspiration to her. It was also her first introduction to philanthropy. “At two years old, I was gifted a violin and lessons,” she says, explaining that an anonymous donor paid for instruments and lessons for all the children at her preschool who, like Bechtel, came from low-income families. In many ways, that violin charted the course of her life. It helped her excel academically, acting as a “catalyst” for getting into college, where she earned her B.A. at the University of California, Santa Barbara, and later an M.B.A. from the University of Southern California. It also helped her earn money busking on city streets or playing in restaurants. But that violin’s most profound impact, perhaps, was teaching Bechtel the power such a charitable gift can have. “Everything wonderful in my life came from learning to play the violin,” she says. “I’ve never stopped being grateful.” Playing the violin in downtown Ventura (on an instrument made in 1787), Bechtel recalls the busking days of her youth. A violin she was gifted as a child served as a catalyst for change. “It was a ticket to my future,” Bechtel says. “Everything wonderful in my life came from learning to play the violin. * Full article available at Ventana Monthly at http://ventanamonthly.com/issue.php?IssueNum=125","metadata":{"source":"https://vccf.org/money-that-matters/","title":"Money That Matters","date":"2016-11-22","contentLength":295}}]